{"class_name": "Model", "keras_version": "2.0.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 16384], "name": "input_pfp", "sparse": false}, "inbound_nodes": [], "name": "input_pfp"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 16384], "name": "input_rxnfp", "sparse": false}, "inbound_nodes": [], "name": "input_rxnfp"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": 1}, "inbound_nodes": [[["input_pfp", 0, 0, {}], ["input_rxnfp", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fp_transform1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1000, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "fp_transform1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fp_transform2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1000, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["fp_transform1", 0, 0, {}]]], "name": "fp_transform2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 803], "name": "input_c1", "sparse": false}, "inbound_nodes": [], "name": "input_c1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 232], "name": "input_s1", "sparse": false}, "inbound_nodes": [], "name": "input_s1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 228], "name": "input_s2", "sparse": false}, "inbound_nodes": [], "name": "input_s2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 2240], "name": "input_r1", "sparse": false}, "inbound_nodes": [], "name": "input_r1"}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["fp_transform2", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "c1_dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_c1", 0, 0, {}]]], "name": "c1_dense"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s1_dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_s1", 0, 0, {}]]], "name": "s1_dense"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s2_dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_s2", 0, 0, {}]]], "name": "s2_dense"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r1_dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_r1", 0, 0, {}]]], "name": "r1_dense"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 1979], "name": "input_r2", "sparse": false}, "inbound_nodes": [], "name": "input_r2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concat_fp_c1_s1_s2", "axis": -1}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["c1_dense", 0, 0, {}], ["s1_dense", 0, 0, {}], ["s2_dense", 0, 0, {}]]], "name": "concat_fp_c1_s1_s2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concat_fp_c1_s1_s2_r1", "axis": -1}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["c1_dense", 0, 0, {}], ["s1_dense", 0, 0, {}], ["s2_dense", 0, 0, {}], ["r1_dense", 0, 0, {}]]], "name": "concat_fp_c1_s1_s2_r1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concat_fp_c1", "axis": -1}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["c1_dense", 0, 0, {}]]], "name": "concat_fp_c1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concat_fp_c1_s1", "axis": -1}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["c1_dense", 0, 0, {}], ["s1_dense", 0, 0, {}]]], "name": "concat_fp_c1_s1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r2_dense", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_r2", 0, 0, {}]]], "name": "r2_dense"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "c1_h1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "c1_h1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r1_h1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concat_fp_c1_s1_s2", 0, 0, {}]]], "name": "r1_h1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r2_h1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concat_fp_c1_s1_s2_r1", 0, 0, {}]]], "name": "r2_h1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s1_h1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concat_fp_c1", 0, 0, {}]]], "name": "s1_h1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s2_h1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concat_fp_c1_s1", 0, 0, {}]]], "name": "s2_h1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concat_fp_c1_s1_s2_r1_r2", "axis": -1}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["c1_dense", 0, 0, {}], ["s1_dense", 0, 0, {}], ["s2_dense", 0, 0, {}], ["r1_dense", 0, 0, {}], ["r2_dense", 0, 0, {}]]], "name": "concat_fp_c1_s1_s2_r1_r2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "c1_h2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["c1_h1", 0, 0, {}]]], "name": "c1_h2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r1_h2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["r1_h1", 0, 0, {}]]], "name": "r1_h2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r2_h2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["r2_h1", 0, 0, {}]]], "name": "r2_h2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s1_h2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["s1_h1", 0, 0, {}]]], "name": "s1_h2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s2_h2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["s2_h1", 0, 0, {}]]], "name": "s2_h2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "T_h1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concat_fp_c1_s1_s2_r1_r2", 0, 0, {}]]], "name": "T_h1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "c1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 803, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["c1_h2", 0, 0, {}]]], "name": "c1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2240, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["r1_h2", 0, 0, {}]]], "name": "r1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "r2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1979, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["r2_h2", 0, 0, {}]]], "name": "r2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 232, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["s1_h2", 0, 0, {}]]], "name": "s1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "s2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 228, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["s2_h2", 0, 0, {}]]], "name": "s2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "T", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["T_h1", 0, 0, {}]]], "name": "T"}], "input_layers": [["input_pfp", 0, 0], ["input_rxnfp", 0, 0], ["input_c1", 0, 0], ["input_r1", 0, 0], ["input_r2", 0, 0], ["input_s1", 0, 0], ["input_s2", 0, 0]], "output_layers": [["c1", 0, 0], ["r1", 0, 0], ["r2", 0, 0], ["s1", 0, 0], ["s2", 0, 0], ["T", 0, 0]], "name": "model_1"}, "backend": "theano"}